In [3]:
import pandas as pd

In [ ]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [4]:
titles = pd.read_csv('C:/Users/user/Desktop/lets upgrade/day17/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [6]:
titles.isnull().sum()

title    0
year     0
dtype: int64

# How many movies are listed in the titles dataframe?

In [35]:
titles['title'].count()

244914

# What are the earliest two films listed in the titles dataframe?

In [38]:
sort1=titles[['title','year']]

res=sort1.sort_values("year",ascending=True)

print(res)
print(res.head(2))

                                                    title  year
193222                                         Miss Jerry  1894
51388                                  The Startled Lover  1898
4584       Reproduction of the Corbett and Jeffries Fight  1899
219198                                     May Day Parade  1900
47548   Pierrot's Problem, or How to Make a Fat Wife O...  1900
...                                                   ...   ...
217349                                  The Dreams I Have  2024
178993                                    Despicable Me 4  2024
34213                                            Avatar 5  2025
183018                           The Zero Century: Maetel  2026
242196                                          100 Years  2115

[244914 rows x 2 columns]
                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

# How many movies have the title "Hamlet"?

In [12]:

print(titles[(titles.title=="Hamlet")].count())

title    20
year     20
dtype: int64


# How many movies are titled "North by Northwest"?

In [13]:

print(titles[(titles.title=="North by Northwest")].count())

title    1
year     1
dtype: int64


# When was the first movie titled "Hamlet" made?

In [22]:
titles[(titles.title=="Hamlet")].sort_values('year').head(1)

        title  year
52521  Hamlet  1910


# List all of the "Treasure Island" movies from earliest to most recent

In [23]:
titles[(titles.title=="Treasure Island")].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999


# How many movies were made in the year 1950?

In [38]:
res6=titles.year==1950
print(titles[res6].shape[0])

1113

# How many movies were made in the year 1960

In [40]:
res7=titles.year==1960
print(titles[res7].shape[0])

1549

# How many movies were made from 1950 through 1959?

In [46]:
lis=[1950,1951,1952,1953,1954,1955,1956,1957,1958,1959]
titles[titles.year.isin(lis)].count()

title    12934
year     12934
dtype: int64

# In what years has a movie titled "Batman" been released?

In [59]:
titles[titles.title=="Batman"]

         title  year
39349   Batman  1943
240896  Batman  1989